#include <iostream> //стандартная библиотека C++
#define _USE_MATH_DEFINES //будем использовать математические костанты
#include <math.h> //подключаем математику
#include <string> //подключаем класс string из std
int win_width = 700; //ширина окна
int win_height = 700; //высота окна

float vert[] = { -1,-1,0,  1,-1,0,  1,1,0,  -1,1,0 };      //координат пола
float vert1[] = { -1,-1,10,  1,-1,10,  1,1,10,  -1,1,10 }; //координат потолка
float floor_color_val = 0.f; //значение цвета для клетки (оно должно отличаться у всех)
float pyr_color_val = 0.f; //значение цвета для пирамиды (оно должно отличаться у всех)
float cub_color_val = 0.f; //значение цвета для куба (оно должно отличаться у всех)
float line_of_coords_x_p[] = { 0,0,0.01f,  9,0,0.01f };  //координаты для оси абцисс+
float line_of_coords_y_p[] = { 0,0,0.01f,  0,9,0.01f };  //координаты для оси ординат+
float line_of_coords_x_m[] = { 0,0,0.01f,  -9,0,0.01f }; //координаты для оси абцисс-
float line_of_coords_y_m[] = { 0,0,0.01f,  0,-9,0.01f }; //координаты для оси ординат-

float pyramid[] = { 0,0,2, 1,1,0, 1,-1,0,   0,0,2, -1,-1,0, -1,1,0,   0,0,2, 1,1,0, -1,1,0,   0,0,2, 1,-1,0, -1,-1,0}; //точки для пирамиды
float cube[] = { -1,-1,0, -1,1,0, -1,1,2, -1,-1,2,   1,1,0, 1,-1,0, 1,-1,2,  1,1,2,   -1,-1,0, 1,-1,0, 1,-1,2, -1,-1,2,   -1,1,0, 1,1,0, 1,1,2, -1,1,2,   1,1,2, 1,-1,2, -1,-1,2, -1,1,2}; //точки для куба
float xAlpha = 0.f; //угол поворота камеры по x
float yAlpha = 0.f; //угол поворота камеры по y
float zAlpha = 0.f; //угол поворота камеры по z

float player_x = 0.f; //позиция игрока по x
float player_y = 0.f; //позиция игрока по y
float player_z = 3.f; //позиция игрока по z
int curs_pos_in_win[2]; //позиция курсора в окне (x, y)

int SELECT_ID = 0; //id клетки

std::string fig_type; //храним вписанное значение типа фигуры
int max_cube_count = 0; //сколько кубов на поле
int max_pyramid_count = 0; //сколько пирамид на поле
int selected_p_id = 0; //id выбранной пирамида
int selected_c_id = 0; //id выбранного куб
bool selType; //Тип выбранной фигуры (1 - пирамида, 0 - куб)

int queryFigId; //здесь хранится id, написанное пользователем
int coordsById[82][2] = { //матрица, здесь id клетки соответствует её координатам
	{},
	{-8,  -8}, {-8, -6}, {-8,  -4}, {-8, -2}, {-8,  0}, {-8, 2}, {-8,  4}, {-8, 6}, {-8,  8}, 
	{-6,  -8}, {-6, -6}, {-6,  -4}, {-6, -2}, {-6,  0}, {-6, 2}, {-6,  4}, {-6, 6}, {-6,  8},
	{-4,  -8}, {-4, -6}, {-4,  -4}, {-4, -2}, {-4,  0}, {-4, 2}, {-4,  4}, {-4, 6}, {-4,  8},
	{-2,  -8}, {-2, -6}, {-2,  -4}, {-2, -2}, {-2,  0}, {-2, 2}, {-2,  4}, {-2, 6}, {-2,  8},
	{0,  -8}, {0, -6}, {0,  -4}, {0, -2}, {0,  0}, {0, 2}, {0,  4}, {0, 6}, {0,  8},
	{2,  -8}, {2, -6}, {2,  -4}, {2, -2}, {2,  0}, {2, 2}, {2,  4}, {2, 6}, {2,  8},
	{4,  -8}, {4, -6}, {4,  -4}, {4, -2}, {4,  0}, {4, 2}, {4,  4}, {4, 6}, {4,  8},
	{6,  -8}, {6, -6}, {6,  -4}, {6, -2}, {6,  0}, {6, 2}, {6,  4}, {6, 6}, {6,  8},
	{8,  -8}, {8, -6}, {8,  -4}, {8, -2}, {8,  0}, {8, 2}, {8,  4}, {8, 6}, {8,  8},
};

int objectsWithCoordsP[11][3] = { //координаты для пирамид (максимум - 10 фигур)
	{},
	{NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL},
};
int objectsWithCoordsC[11][3] = { //координаты для кубов (максимум - 10 фигур)
	{},
	{NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL}, {NULL, NULL, NULL},
};
int deletedP[11] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }; //удалённые пирамиды
int deletedC[11] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }; //удалённые кубы